In [2]:
import pandas as pd

# creating a sample data frame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
       'Age': [25,30,22,35],
       'Salary': [5000, 6000, 7000, 8000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [3]:
df.sort_values(by='Age', ascending=False) # default is ascending

      Name  Age  Salary
3    David   35    8000
1      Bob   30    6000
0    Alice   25    5000
2  Charlie   22    7000

In [6]:
sorted_df = df.sort_values(by = ['Age', 'Salary'], ascending=[True, False])
sorted_df

      Name  Age  Salary
2  Charlie   22    7000
0    Alice   25    5000
1      Bob   30    6000
3    David   35    8000

In [7]:
sorted_df.sort_index()

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [8]:
sorted_df.sort_index(ascending=True)

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [9]:
sorted_df

      Name  Age  Salary
2  Charlie   22    7000
0    Alice   25    5000
1      Bob   30    6000
3    David   35    8000

In [ ]:
# to permanently change the sorted array use inplace
sorted_df.sort_index(ascending=True, inplace=True)